app/controllers/games_controller.rb

  def create
    @game = Game.new(game_params)
    @game.listname_id = params[:listname_id]

    if @game.save
---
INSERT INTO "games" ("bggid", "name", "img", "listname_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["bggid", 193728], ["name", "Pendragon: The Fall of Roman Britain"], ["img", ""], ["listname_id", 1], ["created_at", "2019-08-10 18:17:56.179909"], ["updated_at", "2019-08-10 18:17:56.179909"]]