app/controllers/listnames_controller.rb

SELECT "listnames".* FROM "listnames"
---
  def index
    @listnames = Listname.all

INSERT INTO "listnames" ("created_at", "updated_at", "title", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2019-08-10 00:44:15.446375"], ["updated_at", "2019-08-10 00:44:15.446375"], ["title", "listy"], ["user_id", 4]]
---
  def create
    @listname = Listname.new(listname_params)
    @listname.user_id = params[:user_id]

    if @listname.save

UPDATE "listnames" SET "title" = $1, "updated_at" = $2 WHERE "listnames"."id" = $3  [["title", "list one"], ["updated_at", "2019-08-10 15:18:07.664914"], ["id", 1]]
---
  def update
    if @listname.update(listname_params)

DELETE FROM "listnames" WHERE "listnames"."id" = $1  [["id", 4]]
---
  def destroy
    @listname.destroy

SELECT "listnames".* FROM "listnames" WHERE "listnames"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def set_listname
      @listname = Listname.find(params[:id])