app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "billy"], ["password", "willy"], ["created_at", "2019-08-10 00:38:41.150661"], ["updated_at", "2019-08-10 00:38:41.150661"]]
---
  def create
    @user = User.new(user_params)

    if @user.save